Repository: autohotkey-docs-translation/v2-ja
Catalog: omegat/project_save.tmx
Source language: en
Languages: ja

source: Although primitive values can inherit value properties from their prototype, an exception is thrown if the script attempts to set a value property on a primitive value.
ja: プリミティブ値はそのプロトタイプから値プロパティを継承できますが、スクリプトがプリミティブ値に値プロパティを設定しようとすると例外がスローされます。

source: Although references in static and global variables are released automatically when the program exits, references in non-static local variables or on the expression evaluation stack are not.
ja: 静的変数やグローバル変数への参照は、プログラムが終了すると自動的に解放されるが、非静的ローカル変数や式評価スタックへの参照は解放されない。

source: Although renaming normally has the same effect as moving, it is helpful in cases where you want "all or none" behavior; that is, when you don't want the operation to be only partially successful when Source or one of its files is locked (in use).
ja: リネームは通常、移動と同じ効果をもたらしますが、「all or none」動作を望む場合、つまり、ソースまたはそのファイルの1つがロック（使用中）されている場合に、操作が部分的にしか成功しないことを望まない場合に便利です。

source: Although single-colons within hotstring definitions do not need to be escaped unless they precede the double-colon delimiter, backticks and those semicolons having a space or tab to their left must always be escaped.
ja: ホットストリング定義内のシングルコロンは、ダブルコロンデリミタの前でなければエスケープする必要はありませんが、バックスティックおよびその左にスペースまたはタブを持つセミコロンは常にエスケープする必要があります。

source: Although such errors are rare, the ones most likely to occur are "too many possible empty-string matches" (-22), "recursion too deep" (-21), and "reached match limit" (-8).
ja: このようなエラーは稀ですが、発生しやすいのは「空文字列の可能性が多すぎる」（-22）、「再帰が深すぎる」（-21）、「マッチの限界に達した」（-8）です。

source: Although that sounds like v1, now catch on its own only catches instances of Error.
ja: v1のようですが、現在catch単体ではErrorのインスタンスしか捕捉しません。

source: Although that sounds like v1, now Catch on its own only catches instances of Error.
ja: v1のようですが、現在Catch単体ではErrorのインスタンスしか捕捉しません。

source: Although the Send function's special characters such as {Enter} are supported in auto-replacement text (unless the raw option is used), the hotstring abbreviations themselves do not use this.
ja: 送信機能の特殊文字である{Enter}などは自動置換テキストでサポートされていますが（rawオプションが使用されていない場合）、ホットストリングの略語そのものはこれを使用しません。

source: Although the BlockInput function can be used to prevent any keystrokes physically typed by the user from disrupting the flow of simulated keystrokes, it is often better to use SendInput or SendPlay so that keystrokes and mouse clicks become uninterruptible.
ja: BlockInput関数を使用すると、ユーザーが物理的に入力したキーストロークがシミュレーションされたキーストロークの流れを中断するのを防ぐことができますが、キーストロークとマウスクリックが中断しないようにSendInputまたはSendPlayを使用する方がよい場合があります。

source: Although the Hotkey function cannot directly enable or disable hotkeys in scripts other than its own, in most cases it can override them by creating or enabling the same hotkeys.
ja: ホットキー機能は、自分以外のスクリプトのホットキーを直接有効にしたり無効にしたりすることはできませんが、ほとんどの場合、同じホットキーを作成したり有効にしたりすることで、それらをオーバーライドできます。

source: Although the Launcher Settings GUI presents drop-down lists with options such as "Unicode 32-bit", a list of substrings can be manually entered.
ja: Launcher Settings GUIでは、「Unicode 32-bit」などのオプションがドロップダウンリストに表示されますが、部分文字列のリストは手動で入力することができます。

source: Although the button names are changed, the MsgBox's return value still requires that the buttons be referred to by their original names.
ja: ボタン名は変更されているが、MsgBoxの戻り値は、ボタンが元の名前で参照されることを要求している。

source: Although the file is closed automatically when the object is freed, it is recommended to close the file as soon as possible.
ja: オブジェクトが解放されると自動的にファイルが閉じられますが、できるだけ早くファイルを閉じることをお勧めします。

source: Although the following Joystick control names cannot be used as hotkeys, they can be used with GetKeyState:
ja: 以下のジョイスティックコントロール名はホットキーとして使用できませんが、GetKeyStateで使用することが可能です。

source: Although the following articles discuss reference counting as it applies to COM, they cover some important concepts and rules which generally also apply to AutoHotkey objects:
ja: 以下の記事では、COMに適用される参照カウントについて説明していますが、一般的にAutoHotkeyのオブジェクトにも適用される重要な概念とルールをいくつか取り上げています：

source: Although the following articles discuss reference counting as it applies to COM, they cover some important concepts and rules which generally also apply to AutoHotkey objects: IUnknown::AddRef, IUnknown::Release, Reference Counting Rules.
ja: 以下の記事では、COMに適用される参照カウントについて説明していますが、一般的にAutoHotkeyのオブジェクトにも適用される重要な概念とルールをいくつか取り上げています：IUnknown::AddRef、IUnknown::Release、参照カウント規則。

source: Although the following control names cannot be used as hotkeys, they can be used with GetKeyState:
ja: 以下のコントロール名はホットキーとして使用できませんが、GetKeyStateで使用できます：

source: Although the indentation used in the examples above is optional, it might improve clarity by indicating which lines belong to ones above them.
ja: 上の例で使われているインデントは任意だが、どの行がその上の行に属するかを示すことで、より明瞭になるかもしれない。

source: Although the maximum number of rows in a ListView is limited only by available system memory, row-adding performance can be greatly improved as described in the Count option.
ja: ListViewの最大行数は利用可能なシステムメモリによってのみ制限されますが、Countオプションで説明するように、行追加のパフォーマンスを大幅に向上させることができます。

source: Although the message will not appear at the command prompt, it can be "caught" by means such as redirecting output to a file.
ja: このメッセージはコマンドプロンプトには表示されないが、出力をファイルにリダイレクトするなどの方法で「キャッチ」することができる。

source: Although the name you give the parameter does not matter, it is assigned one of the following numbers:
ja: パラメータに付ける名前は重要ではありませんが、次のいずれかの番号が割り当てられます。

source: Although the name you give the parameter does not matter, it is assigned the GuiControl object of the current GUI control.
ja: パラメータどう名前をつけようとも、現在のGUIコントロールのGuiControlオブジェクトに割り当てられます。

source: Although the names you give the parameters do not matter, the following information is sequentially assigned to them:
ja: パラメータに付ける名前は問いませんが、以下の情報が順次割り当てられます：

source: Although the names you give the parameters do not matter, the following values are sequentially assigned to them:
ja: パラメータに与える名前は重要ではありませんが、以下の値が順次割り当てられます：

source: Although the object can be constructed dynamically, it is more typical for PrefixOrSink to refer to a class or an instance of a class.
ja: オブジェクトは動的に構築することができますが、PrefixOrSinkはクラスまたはクラスのインスタンスを参照するのが一般的です。

source: Although the script can consult GetKeyState after the Input command returns, sometimes it does not accurately reflect which keys were pressed when the Input was terminated.
ja: Inputコマンドの終了後、スクリプトはGetKeyStateを参照することができますが、Inputの終了時にどのキーが押されたかが正確に反映されない場合があります。

source: Although the script might not be in a state safe for execution, the attempt is made, consistent with OnExit.
ja: スクリプトが実行可能な状態でない可能性がありますが、OnExitと同様に実行を試みます。

source: Although the specified maximum value is excluded by design when returning a floating point number, it may in theory be returned due to floating point rounding errors.
ja: 指定された最大値は浮動小数点数を返すときに設計上除外されますが、理論的には浮動小数点の丸め誤差が原因で返される可能性があります。

source: Although the specified maximum value is excluded by design, it may in theory be returned due to floating point rounding errors.
ja: 指定された最大値は設計上除外されているが、浮動小数点の丸め誤差により、理論上は返される可能性があります。

source: Although the standard implementation of GetMethod has limitations as described above, if Value.GetMethod(Name) is used instead of GetMethod(Value, Name), the object Value can define its own implementation of GetMethod.
ja: GetMethodの標準的な実装には上記のような制限がありますが、GetMethod(Value, Name)の代わりにValue.GetMethod(Name)を使用すれば、オブジェクトValueは独自のGetMethodの実装を定義できます。

source: Although the string {Raw} need not occur at the beginning of the string, once specified, it stays in effect for the remainder of the string.
ja: {Raw}という文字列は、文字列の先頭に出現する必要はありませんが、一度指定すると、残りの文字列の間、有効です。

source: Although the string {Text} need not occur at the beginning of the string, once specified, it stays in effect for the remainder of the string.
ja: 文字列{Text}は、文字列の先頭に出現する必要はありませんが、一度指定すると、文字列の残りの部分に対して有効になります。

source: Although the taskbar is skipped due to the WS_EX_TOPMOST style, it is activated if there are no other eligible windows and the active window matches the group.
ja: WS_EX_TOPMOST のスタイルによりタスクバーはスキップされますが、他に対象となるウィンドウがなく、アクティブなウィンドウがグループに一致する場合にアクティブ化されます。

source: Although the theoretical maximum number of items in a TreeView is 65536, item-adding performance will noticeably decrease long before then.
ja: TreeViewのアイテムの理論的な最大数は65536ですが、アイテム追加のパフォーマンスはそれよりもずっと前に顕著に低下します。

source: Although the title shows something like "C:\Windows\System32\cmd.exe", this is a lie; it is actually the 32-bit version, which really resides in "C:\Windows\SysWow64\cmd.exe".
ja: タイトルは"C:\Windows\System32\cmd.exe"ですが、これは嘘で、本当は "C:\Windows\SysWow64\cmd.exe"にある32ビット版なのです。

source: Although there is no ProcessList function, example #1 and example #2 demonstrate how to retrieve a list of processes via DllCall or COM.
ja: ProcessList関数はありませんが、例1、例2は DllCallやCOMでプロセスのリストを取得する方法を示しています。

source: Although there is no built-in variable "A_LoopDelimiter", the example at the very bottom of this page demonstrates how to detect which delimiter was encountered for each field.
ja: 内蔵変数「A_LoopDelimiter」はありませんが、このページの一番下にある例では、各フィールドでどのデリミタに遭遇したかを検出する方法を示しています。

source: Although these look like function calls, they are not, and cannot be used mid-expression.
ja: これらは一見すると関数呼び出しのように見えますが、そうではなく、式の途中で使用することはできません。

source: Although this directive will usually not change how quickly or reliably a window is activated, it might prevent task bar buttons from flashing when different windows are activated quickly one after the other.
ja: このディレクティブは、通常、ウィンドウの起動の速さや信頼性を変えることはありませんが、異なるウィンドウを次々に起動したときに、タスクバーのボタンが点滅するのを防ぐことができます。

source: Although this function is capable of moving files to a different volume, the operation will take longer than a same-volume move.
ja: 本機能は別ボリュームへのファイル移動が可能ですが、同ボリュームへの移動に比べ、操作に時間がかかります。

source: Although this function is unable to create new expressions, it can create new hotkeys using an existing expression.
ja: この機能では、新しい式を作成することはできませんが、既存の式を利用して新しいホットキーを作成することができます。

source: Although this handles only plain text, it seems better
ja: これはプレーンテキストしか扱えませんが、より良いようです。

source: Although this is historically known as a "double-deref", this term is inaccurate when Expr does not contain a variable (first deref), and also when the resulting variable is the target of an assignment, not being dereferenced (second deref).
ja: これは歴史的に「double-deref」として知られているが、Exprが変数を含まない場合（1番目のderef）、また、結果の変数が代入のターゲットであり、参照解除されない場合（2番目のderef）、この用語は不正確である。

source: Although this may cause an unwanted flickering effect when called repeatedly and rapidly, it solves display artifacts for certain control types such as GroupBoxes.
ja: これは、繰り返し高速に呼び出された場合に不要なちらつきが発生する可能性がありますが、GroupBoxなどの特定のコントロールタイプの表示アーチファクトを解決することができます。

source: Although this method cannot move Source onto a different volume, it can move it to any other directory on its own volume.
ja: この方法では、Sourceを別のボリュームに移動することはできませんが、自ボリュームの他のディレクトリに移動することは可能です。

source: Although this method is especially useful for auto-replace hotstrings, it can also be used with any expression.
ja: このメソッドは自動置換ホットストリングに特に有効ですが、どんな式にも使えます。

source: Although this performs better, it must be avoided whenever the thread from which Address is called varies (e.g. when the callback is triggered by an incoming message).
ja: この方が性能は良いのですが、Addressが呼び出されるスレッドが変化する場合（例えば、コールバックが着信メッセージによってトリガーされる場合）には、この方法は避けなければなりません。

source: Although this syntax breaks from tradition, it requires no special delimiters (such as forward-slash), and thus there is no need to escape such delimiters inside the pattern.
ja: この構文は伝統に反するが、特別な区切り文字（スラッシュなど）を必要としないので、パターン内部でそのような区切り文字をエスケープする必要はない。

source: Although this typically causes keystrokes to be sent faster than the active window can process them, the system automatically buffers them.
ja: この場合、通常、アクティブウィンドウが処理できる速度よりも速くキーストロークが送信されることになりますが、システムは自動的にバッファリングします。

source: Although timers may give the illusion that the script is performing more than one task simultaneously, this is not the case.
ja: タイマーは、スクリプトが同時に複数のタスクを実行しているように錯覚させるかもしれませんが、そうではありません。

source: Although timers will operate when the script is suspended, they will not run if the current thread has Thread "NoTimers" in effect or whenever any thread is paused.
ja: タイマーは、スクリプトが中断されても動作しますが、現在のスレッドが Thread "NoTimers"を有効にしている場合、またはいずれかのスレッドが一時停止された場合は、タイマーは動作しません。

source: Although timers will operate when the script is suspended, they will not run if the current thread has Thread NoTimers in effect or whenever any thread is paused.
ja: タイマーは、スクリプトが中断されても動作しますが、現在のスレッドが Thread NoTimersを有効にしている場合、またはいずれかのスレッドが一時停止された場合は、タイマーは動作しません。

source: Always-on-top (style WS_EX_TOPMOST)
ja: 常時トップ（スタイル WS_EX_TOPMOST）

source: Among other benefits, this eliminates ambiguity with the following special strings:
ja: これにより、以下の特殊文字列の曖昧さが解消されるなどの利点があります：

source: Among other benefits, this eliminates ambiguity with the following special strings: On, Off, Toggle, AltTab, ShiftAltTab, AltTabAndMenu, AltTabMenuDismiss.
ja: これにより、以下の特殊文字列の曖昧さが解消されるなどの利点があります：On、Off、Toggle、AltTab、ShiftAltTab、AltTabAndMenu、AltTabMenuDismiss。

source: Ampersand (&) is the reference operator.
ja: アンパサンド（&）は参照演算子です。

source: An "event sink", or object to bind events to.
ja: 「イベントシンク」、つまりイベントをバインドするためのオブジェクトです。

source: An #Include file can contain global code to be executed during script startup, but as with code in the main script file, such code will be executed only if the auto-execute thread is not terminated (such as with an unconditional Return) prior to the #Include directive.
ja: インクルードファイルには、スクリプト起動時に実行されるグローバルコードを含めることができますが、メインスクリプトファイルのコードと同様に、そのようなコードは、#Include指令の前に自動実行スレッドが終了（無条件でReturnなど）されない場合にのみ実行されます。

source: An 8-bit integer, whose range is -128 (-0x80) to 127 (0x7F).
ja: 8ビットの整数で、範囲は-128（-0x80）～127（0x7F）です。

source: An Array of parameters.
ja: パラメータの配列。

source: An Else can be present after the last Catch; this is executed if no exception is thrown within Try.
ja: 最後のCatchの後にElseを置くことができる。これはTryの中で例外が投げられない場合に実行されます。

source: An Error is thrown if any files failed to be changed, with its Extra property set to the number of failures.
ja: ファイルの変更に失敗した場合、ErrorがThrowされ、Extraプロパティには失敗した回数が設定されます。

source: An Error is thrown if any files failed to be copied, with its Extra property set to the number of failures.
ja: ファイルのコピーに失敗した場合、Errorがスローされ、Extraプロパティには失敗の回数が設定されます。

source: An Error is thrown if any files failed to be deleted, with its Extra property set to the number of failures.
ja: 削除に失敗したファイルがある場合、Errorが投げられ、Extraプロパティには失敗の回数が設定されます。

source: An Error is thrown if any files failed to be moved, with its Extra property set to the number of failures.
ja: ファイルの移動に失敗した場合、Errorが投げられ、Extraプロパティには失敗の回数が設定されます。

source: An Error is thrown if the item could not be found.
ja: アイテムが見つからなかったときは、Errorがスローされます。

source: An Error is thrown if there was a problem retrieving the window's text.
ja: ウィンドウのテキストの取得に問題があったときは、Errorがスローされます。

source: An Error is thrown if:
ja: 以下の場合、Errorがスローされます：

source: An Error is thrown on failure, such as if a message returned a failure code or could not be sent.
ja: メッセージが失敗コードを返した場合や送信できなかった場合など、失敗時にErrorが投げられる。

source: An Error is thrown on failure, such as if the options are invalid, the MsgBox limit has been reached, or the message box could not be displayed for some other reason.
ja: オプションが無効な場合、MsgBoxの制限に達した場合、またはその他の理由でメッセージボックスを表示できなかった場合など、失敗するとErrorがスローされます。

source: An Error is thrown on failure.
ja: 失敗するとErrorががスローされます。

source: An Error is typically thrown if the variable does not already exist, or if it is uninitialized and its value is being read.
ja: エラーがスローされるのは、その変数がまだ存在していない場合、あるいは初期化されておらず、その値を読み込もうとしている場合である。

source: An Error or OSError is thrown if the ClassNN could not be determined.
ja: ClassNN を決定できなかった場合は、ErrorまたはOSErrorが投げられる。

source: An Error or OSError is thrown if the change could not be applied.
ja: 変更を適用できなかった場合、ErrorまたはOSErrorがスローされます。

source: An Error or OSError is thrown if the item could not be added.
ja: アイテムを追加できなかった場合は、ErrorまたはOSErrorがスローされます。

source: An Error or OSError is thrown if the item could not be deleted.
ja: アイテムを削除できなかったときは、ErrorまたはOSErrorがスローされます。

source: An Error or OSError is thrown if there was a problem retrieving the text.
ja: テキストの取得に問題があった場合は、ErrorまたはOSErrorがスローされます。

source: An If statement causes its body to be executed or not depending on a condition.
ja: If文は、条件によってその本体が実行されたりされなかったりします。

source: An InputHook with no OnEnd callback ends.
ja: OnEndコールバックがないInputHookは終了します。

source: An OSError is thrown if a message could not be sent to the control, or if the process owning the ListView could not be opened, perhaps due to a lack of user permissions or because it is locked.
ja: コントロールにメッセージを送信できなかった場合、またはユーザー権限の欠如やロックされているためにリストビューを所有するプロセスを開くことができなかった場合、OSErrorがスローされます。

source: An OSError is thrown if a message could not be sent to the control.
ja: コントロールにメッセージを送信できなかったときは、OSErrorがスローされます。

source: An OSError is thrown if a message could not be sent.
ja: メッセージを送信できなかった場合、OSErrorが投げられます。

source: An OSError is thrown if an error occurs.
ja: エラーが発生した場合は、OSErrorがスローされます。

source: An OSError is thrown if an internal function call fails.
ja: 内部関数呼び出しに失敗した場合、OSErrorが投げられる。

source: An OSError is thrown if an internal function call reported failure.
ja: 内部関数呼び出しが失敗を報告した場合、OSErrorがスローされる。

source: An OSError is thrown if the change could not be applied.
ja: 変更が適用できなかったときはOSErrorがスローされます。

source: An OSError is thrown if the control's current position could not be determined.
ja: コントロールの現在位置を特定できなかった場合、OSErrorがスローされます。

source: An OSError is thrown if the conversion could not be performed.
ja: 変換が実行できなかった場合はOSErrorがスローされます。

source: An OSError is thrown if the message could not be posted.
ja: メッセージを投稿できなかった場合、OSErrorがスローされる。

source: An OSError is thrown if the message could not be sent.
ja: メッセージが送信できなかったときは、OSErrorがスローされます。

source: An OSError is thrown if the name/path could not be retrieved.
ja: 名前/パスを取得できなかった場合は、OSErrorがスローされます。

source: An OSError is thrown if the specified region is invalid or could not be applied to the target window.
ja: 指定された領域が無効であったり、ターゲットウィンドウに適用できなかったりすると、OSErrorがスローされる。

source: An OSError is thrown if the style could not be changed.
ja: スタイルを変更できなかった場合、OSErrorがスローされます。

source: An OSError is thrown if there is a problem determining the focus.
ja: フォーカスの決定に問題がある場合、OSErrorがスローされます。

source: An OSError is thrown if there was a problem opening or reading the file.
ja: ファイルのオープンや読み取りに問題があった場合、OSErrorがスローされます。

source: An OSError is thrown if there was a problem sending the SB_GETPARTS message or no reply was received within 2000 ms, or if memory could not be allocated within the process which owns the status bar.
ja: SB_GETPARTSメッセージの送信に問題があったとき、2000 ミリ秒以内に応答がないとき、が受信されなかったとき、またはステータスバーのオーナーのプロセスにメモリを割り当てることができなかったときは、OSErrorがスローされます。

source: An OSError is thrown if there was a problem that prevented the function from conducting the search.
ja: 関数が検索を行うことを妨げる問題があった場合、OSErrorがスローされる。

source: An OSError is thrown if there was a problem, such as a nonexistent key or value when Default is omitted, or a permission error.
ja: Defaultが省略された場合の存在しないキーや値、パーミッションエラーなど、問題があった場合にOSErrorがスローされる。

source: An OSError is thrown on failure, but only if Default is omitted.
ja: Defaultが省略された場合のみ、失敗時にOSErrorが投げられます。

source: An OSError is thrown on failure, such as if the file lacks version information.
ja: ファイルのバージョン情報がない場合など、失敗するとOSErrorがスローされます。

source: An OSError is thrown on failure.
ja: 失敗したときはOSErrorをスローします。

source: An OSError is thrown on if the class name could not be retrieved.
ja: クラス名が取得できなかった場合はOSErrorがスローされます。

source: An OSError may be thrown if a message could not be sent to the control.
ja: コントロールにメッセージを送信できなかった場合、OSErrorがスローされます。

source: An OSError may be thrown on failure.
ja: 失敗するとOSErrorがスローされます。

source: An OnExit callback.
ja: OnExitコールバック。

source: An OnExit thread is executing.
ja: OnExitスレッドが実行されている。

source: An encoding string specifying how to encode the output.
ja: 出力のエンコード方法を指定するエンコード文字列。

source: An encoding can optionally be specified.
ja: オプションでエンコーディングを指定することもできる。

source: An expression which results in an enumerable object, or a variable which contains an enumerable object.
ja: 列挙可能なオブジェクトをもたらす式、または列挙可能なオブジェクトを含む変数。

source: An unsigned Int (UInt) is also used quite frequently, such as for DWORD.
ja: また、符号なしInt（UInt）はDWORDなど、かなり頻繁に使用されます。

source: An unsigned Short (UShort) can be used with functions that expect a WORD.
ja: 符号なしショート（UShort）は、WORDを期待する関数で使用することができます。

source: An unsigned character (UChar) can be used with functions that expect a BYTE.
ja: 符号なし文字（UChar）は、BYTEを期待する関数で使用することができます。

source: An else can be present after the last catch; this is executed if no exception is thrown within try.
ja: 最後のcatchの後にelseを置くことができる。これはtryの中で例外が投げられない場合に実行されます。

source: An Else can be followed immediately by any other single statement on the same line.
ja: Elseの後には、同じ行にある他の単一のステートメントをすぐに続けることができます。

source: An instance variable is one that each instance of the class has its own copy of.
ja: インスタンス変数とは、クラスの各インスタンスがそれ自身のコピーを持つ変数である。

source: An instance is just an object which inherits properties from the class, and can typically also be identified as belonging to that class (such as with the expression instance is ClassName).
ja: インスタンスとは、クラスからプロパティを継承したオブジェクトのことで、通常はそのクラスに属していることを識別することもできます（instance is ClassNameという表現など）。

source: An Else always belongs to the nearest applicable unclaimed statement above it unless a block is used to change that behavior.
ja: Elseは、ブロックを使ってその動作を変更しない限り、常にその上にある最も近い適用可能なunclaimedステートメントに属す。

source: An object combines a number of properties and methods.
ja: オブジェクトは、いくつかのプロパティとメソッドを組み合わせたものである。

source: An Array object contains a list or sequence of values.
ja: 配列オブジェクトは、値のリストまたはシーケンスを含んでいます。

source: An Array object contains a list or sequence of values, with index 1 being the first element.
ja: 配列オブジェクトは、インデックス1が最初の要素である値のリストまたはシーケンスを含んでいます。

source: An AutoHotkey script is basically a set of instructions for the program to follow, written in a custom language exclusive to AutoHotkey.
ja: AutoHotkeyスクリプトは、基本的にAutoHotkey専用のカスタム言語で書かれた、プログラムが従うべき命令の集合体です。

source: An Image-List is a group of identically sized icons stored in memory.
ja: イメージリストは、メモリ上に保存された同一サイズのアイコンのグループです。

source: An Int is sometimes called a "Long".
ja: Intは「Long」と呼ばれることもあります。

source: An Int should also be used for each BOOL argument expected by a function (a BOOL value should be either 1 or 0).
ja: また、関数が期待するBOOL引数（BOOL値は1か0のどちらかでなければならない）には、Intを使用しなければならない。

source: An OnExit function usually should not call ExitApp; if it does, the script terminates immediately.
ja: OnExit関数は、通常、ExitAppを呼び出すべきではありません。

source: An action name or a function to execute (as a new thread) when the hotkey is pressed.
ja: ホットキーが押されたときに実行する（新しいスレッドとして）アクション名または関数です。

source: An additional assignment (or use of the reference operator) within the expression will generally create a variable local to the __Init method.
ja: 式の中で追加の代入（または参照演算子の使用）を行うと、一般的に__Initメソッドのローカル変数が作成される。

source: An ahk_ criterion always consists of an ahk_ keyword and its criterion value, separated by zero or more spaces or tabs.
ja: ahk_基準は常に、ahk_キーワードとその基準値から成り、0個以上の空白またはタブで区切られる。

source: An alt-tab action may take effect on key-down and/or key-up regardless of whether the up keyword is used, and cannot be combined with another action on the same key.
ja: alt-tabアクションは、upキーワードが使用されているかどうかにかかわらず、キーダウンおよび/またはキーアップで有効になる可能性があり、同じキー上の他のアクションと組み合わせることはできません。

source: An alternate method of closing is to send the following message.
ja: 別の方法として、次のようなメッセージを送ることもできます。

source: An alternate method to find out if a particular row number is checked is the following:
ja: 特定の行番号にチェックが入っているかどうかを調べる別の方法として、次のようなものがあります：

source: An alternative is to define a read-only method, as shown below:
ja: 別の方法として、以下のように読み取り専用のメソッドを定義することもできる：
